{"version":"0.4","title":"13","type":"page","content":[{"id":"176cedc9","settings":[],"elements":[{"id":"589dbc26","settings":{"_column_size":100},"elements":[{"id":"797ea081","settings":{"editor":"<!-- wp:paragraph -->\n<p>Although activewear has become more and more acceptable for everyday activities, it doesn’t mean you can rock up in your gym clothes when the dress code is casual. And depending on the event, casual can have a few different meanings. Causal for a wedding or a party usually means a floaty dress or a nice skirt and top. This can often be the dress code for garden or beach weddings. Whereas casual for a work event or friends birthday could mean jeans, heels and a dressy top, or a playful skirt and sweater. There are a few different variations of causal, and if the host doesn’t state semi or dressy casual it will be up to you to figure out the level of dressy. Consider the venue, attendees and scale of the event.<\/p>\n<!-- \/wp:paragraph -->\n\n<!-- wp:heading {\"level\":4} -->\n<h4>What can I wear to a Casual Event?<\/h4>\n<!-- \/wp:heading -->\n\n<!-- wp:paragraph -->\n<p>For birthdays, work events, casual Fridays etc, stick to a great pair of well-fitting jeans or pants, with dressy tops and heels or boots. If it’s semi or dressy casual, think skirts with t-shirts, jumpers or camis, or shorter, not too extravagant dresses. In some cases, you may even be able to get away with chucking on your favourite pair of tennis shoes or sneakers for a sports-luxe vibe. Keep in mind accessories and shoes can be game changers when it comes to casual wear. A ‘dressy’ dress can be played down with boots and leather jacket, whereas a simple pair of black jeans and white tee combo can be elevated with the right jewellery and a killer pair of pumps. Get creative and have fun with it.<\/p>\n<!-- \/wp:paragraph -->\n\n<!-- wp:image {\"id\":153,\"sizeSlug\":\"large\",\"linkDestination\":\"none\"} -->\n<figure class=\"wp-block-image size-large\"><img src=\"https:\/\/191.4e9.myftpupload.com\/wp-content\/uploads\/2021\/01\/BLOG-17.png\" alt=\"\" class=\"wp-image-153\"\/><\/figure>\n<!-- \/wp:image -->"},"elements":[],"isInner":false,"widgetType":"text-editor","elType":"widget"}],"isInner":false,"elType":"column"}],"isInner":false,"elType":"section"}]}