{"version":"0.4","title":"14","type":"page","content":[{"id":"6e0bfba7","settings":[],"elements":[{"id":"2063a1be","settings":{"_column_size":100},"elements":[{"id":"3f674179","settings":{"editor":"<!-- wp:paragraph -->\n<p>Business casual is becoming increasingly popular, even outside the office. But it can be a tricky one, especially if you’re on the hunt for something that can take you from 9 to after 5 with ease. Business casual is professional attire, which isn’t a full uniform or overly formal. It usually involves pencil skirts or slim fit work pants and shirts. Business formal is similar, but as the name suggests it’s a little more dressy. Think a tailored dress with a structured blazer; something you would wear for an important business presentation.<\/p>\n<!-- \/wp:paragraph -->\n\n<!-- wp:heading {\"level\":4} -->\n<h4>What can I wear to a business event?<\/h4>\n<!-- \/wp:heading -->\n\n<!-- wp:paragraph -->\n<p>Go for something a little more on the conservative side that you would still feel comfortable grabbing a drink in for knock-offs. We’d suggest open-collared shirts and sweaters with a pencil skirt and tailored pants. Dresses are fine too, as long as they’re subtle and not too short. Hemlines should be kept at knee-length or just above, and colours should be muted or neutral. Heels should be kept to a sensible height and closed-toe pumps are usually the best choice. A nice pair of flats are also appropriate. If you’re going for a formal business look, try a matching power suit, or a dress and blazer.<\/p>\n<!-- \/wp:paragraph -->\n\n<!-- wp:image {\"id\":150,\"sizeSlug\":\"large\",\"linkDestination\":\"none\"} -->\n<figure class=\"wp-block-image size-large\"><img src=\"https:\/\/191.4e9.myftpupload.com\/wp-content\/uploads\/2021\/01\/BLOG-16.png\" alt=\"\" class=\"wp-image-150\"\/><\/figure>\n<!-- \/wp:image -->"},"elements":[],"isInner":false,"widgetType":"text-editor","elType":"widget"}],"isInner":false,"elType":"column"}],"isInner":false,"elType":"section"}]}